Repository: FeranyDev/DeskSnapshot
Catalog: src/DeskSnapshot/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# AppSubtitle.Text
source: Desktop layout backup
zh_cn: 桌面布局备份

# NavDashboard.Content
source: Overview
zh_cn: 概览

# NavBackups.Content
source: Backups
zh_cn: 备份记录

# NavSettings.Content
source: Settings
zh_cn: 设置

# NavAbout.Content
source: About
zh_cn: 关于

# DashboardTitle.Text
source: Desktop overview
zh_cn: 桌面概览

# DashboardSubtitle.Text
source: Save icon positions and restore them anytime.
zh_cn: 保存图标位置，随时恢复。

# CreateBackupButton.Text
source: Back up now
zh_cn: 立即备份

# HeroTitle.Text
source: Your desktop is ready
zh_cn: 当前桌面已就绪

# HeroEnvironmentInitial.Text
source: Reading display environment…
zh_cn: 正在读取显示环境…

# HeroIconInitial.Text
source: Waiting for the first backup
zh_cn: 等待首次备份

# HistoryLabel.Text
source: Backups
zh_cn: 历史备份

# MonitorsLabel.Text
source: Monitors
zh_cn: 当前显示器

# LastBackupInitial.Text
source: No backups yet
zh_cn: 尚未备份

# LastSavedLabel.Text
source: Last saved
zh_cn: 最近保存

# ProtectionTitle.Text
source: Restore protection is on
zh_cn: 恢复保护已开启

# ProtectionDescription.Text
source: The current layout is saved before every restore.
zh_cn: 恢复前会自动保存当前布局。

# ViewAllBackups.Content
source: View backups
zh_cn: 查看备份

# BackupsTitle.Text
source: Backups
zh_cn: 备份记录

# BackupsSubtitle.Text
source: See when and why each backup was created.
zh_cn: 按时间查看每次备份及其原因。

# NewBackupButton.Text
source: New backup
zh_cn: 新建备份

# EmptyBackups.Text
source: No backups yet. Select “New backup” to save this desktop.
zh_cn: 暂无备份。点击“新建备份”保存当前桌面。

# SelectionHint.Text
source: Select a backup to preview, restore, or delete
zh_cn: 选择记录后可预览、恢复或删除

# DeleteBackup.Content
source: Delete
zh_cn: 删除

# ViewBackup.Content
source: View
zh_cn: 查看

# RestoreBackupButton.Text
source: Restore layout
zh_cn: 恢复布局

# SettingsTitle.Text
source: Settings
zh_cn: 设置

# SettingsSubtitle.Text
source: Configure backups, startup, and appearance.
zh_cn: 调整备份、启动和外观。

# AutoBackupTitle.Text
source: Automatic backup
zh_cn: 自动备份

# AutoBackupInitial.Text
source: Automatic backup is off
zh_cn: 自动备份已关闭

# AutoBackupToggle.OffContent
source: Off
zh_cn: 关

# AutoBackupToggle.OnContent
source: On
zh_cn: 开

# ScheduledTitle.Text
source: Scheduled backup
zh_cn: 定时备份

# ScheduledDescription.Text
source: Save the layout at a fixed interval.
zh_cn: 按固定间隔保存布局。

# IntervalLabel.Text
source: Interval
zh_cn: 备份间隔

# Interval5.Content
source: Every 5 minutes
zh_cn: 每 5 分钟

# Interval15.Content
source: Every 15 minutes
zh_cn: 每 15 分钟

# Interval30.Content
source: Every 30 minutes
zh_cn: 每 30 分钟

# Interval60.Content
source: Every hour
zh_cn: 每 1 小时

# Interval180.Content
source: Every 3 hours
zh_cn: 每 3 小时

# EventTriggersTitle.Text
source: Event triggers
zh_cn: 事件触发

# EventTriggersDescription.Text
source: Changes must stabilize before a backup is created.
zh_cn: 变化稳定后再备份，避免重复记录。

# StartupTrigger.Content
source: App launch
zh_cn: 程序启动

# DisplayTrigger.Content
source: Monitor, resolution, or DPI change
zh_cn: 显示器、分辨率或 DPI 变化

# DesktopTrigger.Content
source: Desktop icon or position change
zh_cn: 桌面图标或位置变化

# RetentionLabel.Text
source: Automatic backup limit
zh_cn: 自动备份保留数量

# RetentionText.Text
source: Keep 1–200; the oldest automatic backups are removed first.
zh_cn: 可保留 1–200 份；超出后自动删除最早记录。

# BackgroundTitle.Text
source: Startup and background
zh_cn: 启动与后台

# BackgroundInitial.Text
source: Optionally start with Windows or run in the notification area.
zh_cn: 可选开机启动或通知区域运行。

# RunAtStartupTitle.Text
source: Start with Windows
zh_cn: 开机启动

# RunAtStartupDescription.Text
source: Start when the current Windows user signs in.
zh_cn: 随当前 Windows 用户登录启动。

# TrayModeTitle.Text
source: Keep running after the window closes
zh_cn: 关闭后在通知区域运行

# TrayModeDescription.Text
source: Automatic backups continue; reopen or quit from the tray.
zh_cn: 后台继续自动备份；从托盘重新打开或退出。

# ThemeTitle.Text
source: Theme
zh_cn: 应用主题

# ThemeDescription.Text
source: Choose the app color mode.
zh_cn: 选择界面明暗模式。

# ThemeSystem.Content
source: Use system setting
zh_cn: 跟随系统

# ThemeLight.Content
source: Light
zh_cn: 浅色

# ThemeDark.Content
source: Dark
zh_cn: 深色

# LanguageTitle.Text
source: Display language
zh_cn: 界面语言

# LanguageDescription.Text
source: The app restarts after a change.
zh_cn: 切换后应用会自动重启。

# LanguageSystem.Content
source: Use system setting
zh_cn: 跟随系统

# SafetyBackupTitle.Text
source: Pre-restore backup
zh_cn: 恢复前备份

# SafetyBackupDescription.Text
source: Always on, so an accidental restore can be undone.
zh_cn: 始终开启，防止误恢复后无法撤回。

# AboutTitle.Text
source: About
zh_cn: 关于

# AboutSubtitle.Text
source: Version, data, and privacy information.
zh_cn: 版本、数据和隐私信息。

# AboutTagline.Text
source: A lightweight, offline desktop icon layout backup tool
zh_cn: 轻量、离线的桌面图标布局备份工具

# VersionInitial.Text
source: Version 1.0.0
zh_cn: 版本 1.0.0

# LocalStorageTitle.Text
source: Local, offline storage
zh_cn: 本地离线存储

# LocalStorageDescription.Text
source: Layouts and settings stay on this PC and are never uploaded.
zh_cn: 布局和设置只保存在本机，不会上传。

# BackupDataLocation.Text
source: Backup data location
zh_cn: 备份数据位置

# SafeWriteTitle.Text
source: Safe writes
zh_cn: 安全写入

# SafeWriteDescription.Text
source: Atomic JSON writes; damaged files are isolated automatically.
zh_cn: JSON 原子写入，损坏文件会自动隔离。

# RecoveryProtectionTitle.Text
source: Restore protection
zh_cn: 恢复保护

# RecoveryProtectionDescription.Text
source: The current desktop is saved before a restore.
zh_cn: 恢复前保存当前桌面，便于撤回。

# TechnicalInfoTitle.Text
source: Compatibility
zh_cn: 兼容性

# TechnicalInfoDemo.Text
source: Supports the standard desktop managed by Windows Explorer.
zh_cn: 支持由 Windows 资源管理器管理的标准桌面。

# BusyInitial.Text
source: Processing desktop layout…
zh_cn: 正在处理桌面布局…

# PreviewRestoreButton.Text
source: Restore layout
zh_cn: 恢复布局

# PreviewEmpty.Text
source: This backup has no icon positions to display
zh_cn: 此备份没有可显示的图标位置

# ComparisonLoading.Text
source: Comparing with the current desktop…
zh_cn: 正在与当前桌面对比…

# LegendMoved.Text
source: Moved
zh_cn: 已移动

# LegendAdded.Text
source: Added now
zh_cn: 当前新增

# LegendMissing.Text
source: Missing now
zh_cn: 当前缺失

# LegendUnchanged.Text
source: Unchanged
zh_cn: 未变化

# ShowChangesOnly.Content
source: Changes only
zh_cn: 仅显示变化

# WindowTitle
source: DeskSnapshot - Desktop layout backup
zh_cn: DeskSnapshot - 桌面布局备份

# VersionFormat
source: Version {0}.{1}.{2}
zh_cn: 版本 {0}.{1}.{2}

# ReadFailed
source: Could not load data
zh_cn: 读取失败

# MonitorCountFormat
source: {0} monitor(s)
zh_cn: {0} 台显示器

# LatestIconCountFormat
source: Latest: {0} icons
zh_cn: 最近记录 {0} 个图标

# TodayDateFormat
source: Today · {0}
zh_cn: 今天 · {0}

# YesterdayDateFormat
source: Yesterday · {0}
zh_cn: 昨天 · {0}

# RecordCountFormat
source: {0} record(s)
zh_cn: {0} 条记录

# IconCountFormat
source: {0} icons
zh_cn: {0} 个图标

source: Manual backup
zh_cn: 手动备份

source: Automatic backup
zh_cn: 自动备份

# SafetyBackup
source: Pre-restore backup
zh_cn: 恢复前备份

# AutomaticReasonFormat
source: Triggered by “{0}”
zh_cn: 由“{0}”触发

# SafetySummary
source: Saved the desktop before a restore
zh_cn: 恢复前自动保存了当时的桌面

# SafetySummaryNamed
source: Saved the desktop before restoring “{0}”
zh_cn: 恢复“{0}”前自动保存了当时的桌面

# ReasonDesktopChange
source: icon layout change
zh_cn: 图标布局变化

# ReasonDisplayChange
source: display environment change
zh_cn: 显示环境变化

# ReasonStartup
source: app launch
zh_cn: 程序启动

# ReasonSchedule
source: schedule
zh_cn: 定时

# ReasonRule
source: automatic backup rule
zh_cn: 自动备份规则

# BackupNameHeader
source: Backup name
zh_cn: 备份名称

# BackupNoteHeader
source: Note (optional)
zh_cn: 备注（可选）

# BackupNotePlaceholder
source: For example: dual-monitor layout
zh_cn: 例如：双显示器布局

# DesktopLayoutNameFormat
source: Desktop layout {0}
zh_cn: 桌面布局 {0}

# SaveLayoutTitle
source: Save current desktop layout
zh_cn: 保存当前桌面布局

source: Create backup
zh_cn: 创建备份

source: Cancel
zh_cn: 取消

# ReadingIcons
source: Reading desktop icons…
zh_cn: 正在读取桌面图标…

# BackupCompleted
source: Backup complete
zh_cn: 备份已完成

# BackupCompletedMessage
source: Saved {0} desktop icons.
zh_cn: 已记录 {0} 个桌面图标。

source: Backup failed
zh_cn: 备份失败

# RestoreTitle
source: Restore desktop layout?
zh_cn: 恢复桌面布局？

# RestoreConfirm
source: “{0}” will be restored. The current layout is saved first.
zh_cn: 将恢复“{0}”。当前布局会先保存为安全备份。

# RestoreFollowMonitors
source: Follow monitor positions
zh_cn: 跟随显示器位置恢复图标

# RestoreFollowMonitorsDescription
source: Keep icons on the same monitors and at the same relative positions when the monitor arrangement changes.
zh_cn: 显示器排列发生变化时，让图标保持在原来的显示器及相对位置。

source: Restore
zh_cn: 恢复

# CreatingSafetyBackup
source: Creating pre-restore backup…
zh_cn: 正在创建恢复前备份…

# RestoringIcons
source: Restoring icon positions…
zh_cn: 正在恢复图标位置…

# RestoreCompleted
source: Restore complete
zh_cn: 恢复完成

# RestoreResult
source: Restored {0} icons, skipped {1}, failed {2}.
zh_cn: 已恢复 {0} 个图标，跳过 {1} 个，失败 {2} 个。

# RestoreResultMapped
source: Restored {0} icons, skipped {1}, failed {2}; {3} followed their monitors.
zh_cn: 已恢复 {0} 个图标，跳过 {1} 个，失败 {2} 个；其中 {3} 个跟随显示器重新定位。

source: Restore failed
zh_cn: 恢复失败

# DeleteTitle
source: Delete this backup?
zh_cn: 删除这条备份？

# DeleteConfirm
source: “{0}” will be permanently deleted from this PC.
zh_cn: “{0}”将从本机永久删除。

# DeleteMultipleTitle
source: Delete selected backups?
zh_cn: 删除选中的备份？

# DeleteMultipleConfirm
source: The {0} selected backups will be permanently deleted. Unselected child backups will be kept.
zh_cn: 选中的 {0} 份备份将从本机永久删除，未选中的子备份会继续保留。

source: Delete
zh_cn: 删除

source: Backup deleted
zh_cn: 备份已删除

# BackupDeletedMessage
source: Local records were updated.
zh_cn: 本地记录已更新。

# BackupsDeletedMessage
source: Deleted {0} backups. Local records were updated.
zh_cn: 已删除 {0} 份备份，本地记录已更新。

# SelectedFormat
source: Selected: {0}
zh_cn: 已选择：{0}

# SelectedCountFormat
source: {0} backups selected; batch delete is available
zh_cn: 已选择 {0} 份备份；可批量删除

# RestartingLanguage
source: Switching language…
zh_cn: 正在切换语言…

# BackgroundSettingsFailed
source: Background setting failed
zh_cn: 后台设置失败

# AutoBackupOff
source: Automatic backup is off
zh_cn: 自动备份已关闭

# EveryMinutesFormat
source: Every {0} minutes
zh_cn: 每 {0} 分钟

# AutoNoTrigger
source: Automatic backup is on with no trigger selected
zh_cn: 自动备份已开启，尚未选择触发方式

# EnabledModesFormat
source: Enabled: {0}
zh_cn: 已启用：{0}

# AutoBackupFailedFormat
source: Automatic backup check failed: {0}
zh_cn: 自动备份检测失败：{0}

# LastAutoBackupFormat
source: Last automatic backup: {0} ({1})
zh_cn: 上次自动备份：{0}（{1}）

# TrayRunningTitle
source: DeskSnapshot is running in the background
zh_cn: DeskSnapshot 正在后台运行

# TrayRunningMessage
source: Automatic backups continue. Double-click the tray icon to reopen.
zh_cn: 自动备份会继续运行；双击托盘图标可打开主窗口。

# TrayBusy
source: Another backup is in progress. Try again shortly.
zh_cn: 正在处理另一项备份，请稍后再试。

# TrayBackupNameFormat
source: Tray backup {0}
zh_cn: 托盘快速备份 {0}

# TrayBackupNote
source: Created manually from the notification area
zh_cn: 从通知区域手动创建

# PreviewTitleFormat
source: {0} - Layout preview
zh_cn: {0} - 布局预览

# PreviewSummaryFormat
source: {0} · {1} icons · {2} × {3} · DPI {4} · {5} monitor(s)
zh_cn: {0} · {1} 个图标 · {2} × {3} · DPI {4} · {5} 台显示器

# PreviewMonitorsFormat
source: Monitors: {0}
zh_cn: 显示器：{0}

# PreviewHint
source: Hover over an icon to see its name and coordinates
zh_cn: 悬停图标查看名称和坐标

# PreviewEmptyText
source: This backup has no icon positions to display
zh_cn: 此备份没有可显示的图标位置

# ComparisonCurrentLayout
source: Current desktop comparison snapshot
zh_cn: 当前桌面对比快照

# ComparisonFailedFormat
source: Could not read the current desktop for comparison: {0}
zh_cn: 无法读取当前桌面进行对比：{0}

# ComparisonSummaryFormat
source: Compared with now: {0} moved · {1} added · {2} missing · {3} unchanged
zh_cn: 与当前桌面对比：移动 {0} · 新增 {1} · 缺失 {2} · 未变化 {3}

# DifferenceVirtualSize
source: virtual desktop size
zh_cn: 虚拟桌面尺寸

# DifferenceMonitorCount
source: monitor count
zh_cn: 显示器数量

# DifferenceMonitorLayout
source: monitor devices or arrangement
zh_cn: 显示器设备或排列

# EnvironmentMatches
source: The display environment matches this backup.
zh_cn: 显示环境与备份一致。

# EnvironmentDifferencesFormat
source: Display environment changed: {0}
zh_cn: 显示环境变化：{0}

# AmbiguousMatchesFormat
source: {0} duplicate-name icons were paired by Explorer order and may not be unique.
zh_cn: {0} 个同名图标按 Explorer 中的出现顺序匹配，结果可能不唯一。

# NoDifferences
source: The current desktop has no icon differences from this backup
zh_cn: 当前桌面与此备份没有图标差异

# DifferenceMovedTooltipFormat
source: {0} Current X {1} · Y {2} → backup X {3} · Y {4}
zh_cn: {0} 当前位置 X {1} · Y {2} → 备份位置 X {3} · Y {4}

# DifferenceAddedTooltipFormat
source: {0} Added now · X {1} · Y {2}
zh_cn: {0} 当前新增 · X {1} · Y {2}

# DifferenceMissingTooltipFormat
source: {0} Missing now · backup X {1} · Y {2}
zh_cn: {0} 当前缺失 · 备份位置 X {1} · Y {2}

# DifferenceUnchangedTooltipFormat
source: {0} Unchanged · X {1} · Y {2}
zh_cn: {0} 位置未变化 · X {1} · Y {2}

# AmbiguousTooltip
source: This item has duplicate names and was paired by occurrence order.
zh_cn: 存在同名图标，此项按出现顺序匹配。

# PreviewNoteFormat
source: Note: {0}
zh_cn: 备注：{0}

source: No backups yet
zh_cn: 尚未备份

# WaitingFirstBackup
source: Waiting for the first backup
zh_cn: 等待首次备份

# SelectionHintDynamic
source: Select a backup to preview, restore, or delete
zh_cn: 选择记录后可预览、恢复或删除

# BusyText
source: Processing desktop layout…
zh_cn: 正在处理桌面布局…

# RunAtStartupEnabled
source: Starts with Windows
zh_cn: 已开机自启

# TrayModeEnabled
source: Background mode enabled
zh_cn: 已启用后台运行

# BackgroundModeOff
source: Optionally start with Windows or run in the notification area.
zh_cn: 可选开机启动或通知区域运行。

# TrayUnavailable
source: The notification area icon is unavailable on this system.
zh_cn: 当前系统无法创建通知区域图标。

# StartupRequestDenied
source: Windows did not allow startup. Change it under Settings > Apps > Startup.
zh_cn: Windows 未允许开机启动。可在“设置 > 应用 > 启动”中调整。

# StartupRegistryUnavailable
source: Could not open the current user's startup settings.
zh_cn: 无法打开当前用户的启动项设置。

# ExecutablePathUnavailable
source: Could not determine the DeskSnapshot executable path.
zh_cn: 无法确定 DeskSnapshot 的程序路径。

# TrayIconLoadFailed
source: Could not load the notification area icon.
zh_cn: 无法加载通知区域图标。

# TrayMessageHookFailed
source: Could not connect notification area messages.
zh_cn: 无法连接通知区域消息。

# TrayIconCreateFailed
source: Could not create the notification area icon.
zh_cn: 无法创建通知区域图标。

# TrayIconRemoveFailed
source: Could not remove the notification area icon.
zh_cn: 无法移除通知区域图标。

# TrayOpen
source: Open DeskSnapshot
zh_cn: 打开 DeskSnapshot

# TrayBackupNow
source: Back up now
zh_cn: 立即备份

# TrayExit
source: Exit
zh_cn: 退出

# AppDescription
source: Local desktop icon layout backup and restore
zh_cn: 本地桌面图标布局备份与恢复工具

# UnnamedIconFormat
source: Unnamed icon #{0}
zh_cn: 未命名图标 #{0}

# ExplorerDesktopNotFound
source: Could not find the Windows Explorer desktop. Make sure Explorer is running.
zh_cn: 找不到 Windows Explorer 桌面视图。请确认 Explorer 正在运行。

# DesktopIconListNotFound
source: Could not find the desktop icon list. This desktop shell may not be supported.
zh_cn: 找不到桌面图标列表。当前桌面外壳可能不受支持。

# ExplorerNotResponding
source: Windows Explorer did not respond to the desktop layout request.
zh_cn: Windows Explorer 未响应桌面布局请求。

# ExplorerProcessUnavailable
source: Could not access the Windows Explorer process.
zh_cn: 无法读取 Windows Explorer 进程。

# LayoutBufferAllocationFailed
source: Could not allocate the desktop layout buffer.
zh_cn: 无法分配桌面布局缓冲区。

# LayoutBufferWriteFailed
source: Could not write to the desktop layout buffer.
zh_cn: 无法写入桌面布局缓冲区。

# LayoutBufferReadFailed
source: Could not read the desktop layout buffer.
zh_cn: 无法读取桌面布局缓冲区。

# NavProfiles.Content
source: Display profiles
zh_cn: 显示器档案

# ProfilesTitle.Text
source: Display layout profiles
zh_cn: 显示器布局配置档案

# ProfilesSubtitle.Text
source: Save layouts for familiar monitor setups. Matches are suggested and never restored automatically.
zh_cn: 为常用显示器组合保存布局；匹配后只提示，不会自动恢复。

# SaveAsProfile.Content
source: Save as profile
zh_cn: 保存为档案

# CurrentTopologyTitle.Text
source: Current monitor setup
zh_cn: 当前显示器组合

# EmptyProfiles.Text
source: No display profiles yet. Select a backup under Backup history and save it as a profile.
zh_cn: 暂无配置档案。请在备份记录中选择一份备份并保存为档案。

# ProfileMatchedBadge.Text
source: Current match
zh_cn: 当前匹配

# ProfileSelectionHint.Text
source: Select a profile to preview or restore it. A safety backup is still created before restoring.
zh_cn: 选择档案后可预览或恢复；恢复前仍会创建安全备份。

# RemoveProfile.Content
source: Remove profile
zh_cn: 移除档案

# ViewProfile.Content
source: View layout
zh_cn: 查看布局

# RestoreProfile.Text
source: Restore profile
zh_cn: 恢复此档案

# ProfileNameHeader
source: Profile name
zh_cn: 档案名称

# SaveAsProfileTitle
source: Save display layout profile
zh_cn: 保存显示器布局档案

# SaveAsProfileDescription
source: This profile remembers the monitor setup, arrangement, and icon positions in this backup.
zh_cn: 此档案会记住显示器组合、排列和这份备份中的图标位置。

source: Save profile
zh_cn: 保存档案

# ProfileSaved
source: Display profile saved
zh_cn: 配置档案已保存

# ProfileSavedMessage
source: “{0}” will be suggested when the same monitor setup appears.
zh_cn: “{0}”将在相同显示器组合出现时被推荐。

# ProfileSavedAtFormat
source: Saved {0}
zh_cn: 保存于 {0}

# ProfileSummaryFormat
source: {0} monitor(s) · {1} × {2} · {3} icons
zh_cn: {0} 台显示器 · {1} × {2} · {3} 个图标

# CurrentTopologySummaryFormat
source: {0} monitor(s) · {1} × {2} · DPI {3}
zh_cn: {0} 台显示器 · {1} × {2} · DPI {3}

# MatchedProfileFormat
source: Matches: {0}
zh_cn: 匹配：{0}

# RemoveProfileTitle
source: Remove display profile
zh_cn: 移除配置档案

# RemoveProfileConfirm
source: Remove “{0}” as a profile? Its original backup will be kept.
zh_cn: 确定移除“{0}”吗？原始备份仍会保留。

# ProfileRemoved
source: Display profile removed
zh_cn: 配置档案已移除

# ProfileRemovedMessage
source: The original backup was not deleted.
zh_cn: 原始备份没有被删除。

# MatchedProfileTitle
source: Matching display profile found
zh_cn: 找到匹配的显示器档案

# MatchedProfileSuggestion
source: The current monitor setup matches “{0}”. Open the profile to review it before restoring.
zh_cn: 当前显示器组合匹配“{0}”。可打开档案检查后恢复。

# OpenProfiles
source: View profiles
zh_cn: 查看档案

# MonitorMappingTitle
source: Monitor target mapping
zh_cn: 显示器目标映射

# MonitorMappingRequired
source: Some original monitors are missing; choose their targets
zh_cn: 部分原显示器缺失，请选择目标显示器

# MonitorMappingKeepAbsolute
source: Do not map; keep absolute coordinates
zh_cn: 不映射，保留绝对坐标

# MonitorMappingSourceFormat
source: Original: {0} ({1} × {2})
zh_cn: 原：{0}（{1} × {2}）

# RememberMonitorMapping
source: Remember mapping for this monitor combination
zh_cn: 记住此显示器组合的映射选择
